R = 51; % 电阻
L = 3.3e-4; % 电感
C = 6.8e-7; % 电容
Wn = 1/sqrt(L*C); % 固有频率
zeta = R*sqrt(C/L)/2; % 阻尼比
zeta1 = sqrt(L/C)/2/R; % 阻尼比
fn = Wn/(2*pi); % 频率
f_fn = [0.01:0.01:0.09 0.1:0.1:0.9 1:9 10:10:100];  % 频率范围
f_fn1 = [0.02,0.05,0.08 0.1:0.1:0.9 1:9 10,20,50]; % 频率范围
f = fn *  f_fn1; % 频率

% 实测数据
X2 = [5.07 4.90 4.75 4.62 3.95 3.38 3.10 2.85 2.70 2.60 2.55 2.52 2.50 2.70 3.03 3.37 3.63 3.90 4.07 4.20 4.30 4.40 4.73 4.83]; 
Y2 = [0.240 0.550 0.860 1.05 1.70 2.00 2.15 2.22 2.28 2.32 2.32 2.32 2.32 2.20 2.06 1.90 1.74 1.62 1.47 1.36 1.26 1.16 0.670 0.280]; 
H2 = 2i*zeta*f_fn./((1i*f_fn).*(1i*f_fn)+2*zeta*(1i*f_fn)+1); % 频率响应
HS2 = Y2./X2; % 实测数据
H2bode = 20*log10(abs(H2)); % 幅值
HS2bode = 20*log10(abs(HS2)); % 实测数据的幅值

% (f) 绘制幅频响应曲线和实测数据
semilogx(f_fn,H2bode,'r',f_fn1,HS2bode,'b'); % 绘制幅频响应曲线和实测数据
title('二阶系统2的频率响应'); % 绘制幅频响应曲线和实测数据的标题
xlabel("\omega(rad/s)"); % x轴标签
ylabel("幅值(dB)") % y轴标签
legend('理论值','实际值'); % 绘制幅频响应曲线和实测数据的图例
grid 

% 计算并绘制零极点图
num = [2*zeta, 0];% 分子
den = [1, 2*zeta, 1];% 分母
figure;
zplane(num, den);% 计算并绘制零极点图
title('二阶系统2的零极点图');% 绘制零极点图的标题
grid on; % 绘制网格