R = 51; % 电阻
L = 3.3e-4; % 电感
C = 6.8e-7; % 电容
Wn = 1/sqrt(L*C); % 固有频率
zeta = R*sqrt(C/L)/2; % 阻尼比
zeta1 = sqrt(L/C)/2/R; % 阻尼比
fn = Wn/(2*pi); % 频率
f_fn = [0.01:0.01:0.09 0.1:0.1:0.9 1:9 10:10:100];  % 频率范围
f_fn1 = [0.02,0.05,0.08 0.1:0.1:0.9 1:9 10,20,50]; % 频率范围
f = fn *  f_fn1; % 频率

% 实测数据
X1 = [5.10 4.87 4.75 4.62 4.00 3.35 3.10 2.85 2.70 2.60 2.55 2.52 2.49 2.72 3.00 3.40 3.70 3.95 4.10 4.25 4.35 4.45 4.75 4.80]; 
Y1 = [4.98 4.92 4.69 4.55 3.70 3.00 2.40 2.05 1.70 1.45 1.30 1.15 1.05 0.50 0.30 0.22 0.15 0.12 0.10 0.08 0.07 0.06 0.02 0.005]; 
H1 = 1./((1i*f_fn).*(1i*f_fn)+2*zeta*(1i*f_fn)+1); % 频率响应
HS1 = Y1./X1; % 实测数据
H1bode = 20*log10(abs(H1)); % 幅值
HS1bode = 20*log10(abs(HS1)); % 实测数据的幅值

% (f) 绘制幅频响应曲线和实测数据
semilogx(f_fn,H1bode,'r',f_fn1,HS1bode,'b'); % 绘制幅频响应曲线和实测数据
title('二阶系统1的频率响应'); % 绘制幅频响应曲线和实测数据的标题
xlabel("\omega(rad/s)"); % x轴标签
ylabel("幅值(dB)") % y轴标签
legend('理论值','实际值'); % 绘制幅频响应曲线和实测数据的图例
grid on

% 计算并绘制零极点图
num = [1]; % 分子
den = [1, 2*zeta, 1]; % 分母
figure;
zplane(num, den); % 计算并绘制零极点图
title('二阶系统1的零极点图'); % 绘制零极点图的标题
grid on; % 绘制网格