R = 51; % 电阻
L = 3.3e-4; % 电感
C = 6.8e-7; % 电容
Wn = 1/sqrt(L*C); % 固有频率
zeta = R*sqrt(C/L)/2; % 阻尼比
zeta1 = sqrt(L/C)/2/R; % 阻尼比
fn = Wn/(2*pi); % 频率
f_fn = [0.01:0.01:0.09 0.1:0.1:0.9 1:9 10:10:100];  % 频率范围
f_fn1 = [0.02,0.05,0.08 0.1:0.1:0.9 1:9 10,20,50]; % 频率范围
f = fn *  f_fn1; % 频率

% 实测数据
X3 = [5.06 4.92 4.90 4.78 4.38 3.75 3.18 2.65 2.10 1.68 1.35 1.08 0.95 1.50 1.90 2.10 2.18 2.25 2.27 2.30 2.30 2.33 2.33 2.33]; 
Y3 = [0.0170 0.0360 0.0575 0.0750 0.200 0.360 0.540 0.725 0.910 1.05 1.20 1.32 1.42 1.98 2.16 2.24 2.28 2.32 2.32 2.34 2.36 2.36 2.36 2.36]; 
H3 = 1i*(1i*f_fn).*(1i*f_fn)./((1i*f_fn).*(1i*f_fn)+2*zeta1*(1i*f_fn)+1); % 频率响应
HS3 = Y3./X3; % 实测数据
H3bode = 20*log10(abs(H3));  % 幅值
HS3bode = 20*log10(abs(HS3)); % 实测数据的幅值

% (f) 绘制幅频响应曲线和实测数据
semilogx(f_fn,H3bode,'r',f_fn1,HS3bode,'b'); % 绘制幅频响应曲线和实测数据
title('二阶系统3的频率响应'); % 绘制幅频响应曲线和实测数据的标题
xlabel("\omega(rad/s)"); % x轴标签
ylabel("幅值(dB)"); % y轴标签
legend('理论值','实际值'); % 绘制幅频响应曲线和实测数据的图例
grid

% 计算并绘制零极点图
num = [0, 1];% 分子
den = [1, 2*zeta1, 1];% 分母
figure;
zplane(num, den);% 计算并绘制零极点图
title('二阶系统3的零极点图');% 绘制零极点图的标题
grid on;% 绘制网格